[
{"Title": "Z (1969) - full transcript", "Plot": "In a mid-sized metropolis (population 500,000) in a right-wing military led country, a pacifist organization, which supports the opposition party in the government, is planning on holding an anti-military, nuclear disarmament rally. The organization's charismatic leader - the deputy - is scheduled to arrive in the town from the capital the day of the rally. Beyond the problems arranging the rally due to the probable incitement of violence at such a rally, the organization learns of an unconfirmed report that there will be an attempt on the deputy's life. The rally does happen, after which a three-wheeled kamikaze runs over the deputy, who eventually passes away from his injuries. The official report is that the incident was a drunken accident. In reality, the deputy's death was murder orchestrated by the secret police, the general for who likens the pacifist organization to mildew killing off agricultural crops. A magistrate is assigned to the case. Although he does have political views, he is more interested in finding out the truth, and as such has to wade through the political rhetoric and politically motivated testimony he hears. Thrown into the mix is a photojournalist who too is looking for the truth, as it, he believes, will make a great front page story."},
{"Title": "Z (2019) - full transcript", "Plot": "A family find themselves terrorized by their eight-year-old son's imaginary friend."},
{"Title": "Z miasta Lodzi (1968) - full transcript", "Plot": "This documentary explores the changing faces of the old Polish city of Lodz, and how its modernization, both physically and culturally, affects the older, more conservative residents, many ..."},
{"Title": "Z-O-M-B-I-E-S (2018) - full transcript", "Plot": "Students from Zombietown are transferred to a high school in a suburban town preoccupied with uniformity, traditions and pep rallies."},
{"Title": "Z-O-M-B-I-E-S 2 (2020) - full transcript", "Plot": "The continuing adventures of Seabrook High students Addison and Zed, whose budding romance is threatened by the arrival of werewolves."},
{"Title": "Z.P.G. (1972) - full transcript", "Plot": "In the not too distant future, a very smoggy and overpopulated Earth government makes it illegal to have children for a generation. One couple, unsatisfied with their substitute robot baby, breaks the rules and gets in a lot of trouble. (Z.P.G. stands for Zero Population Growth.)"},
{"Title": "Za duzy na bajki (2022) - full transcript", "Plot": "In Waldek's life, filled mainly with computer games, there is a real earthquake. During her absence, mum stays under the care of a crazy and unpredictable aunt, who introduces discipline that has been alien to him so far and imposes new duties. But although an extraordinary relative gives Waldek a real survival camp, the boy also receives the most valuable life lesson from her."},
{"Title": "Za ji wang ming dui (1979) - full transcript", "Plot": "The heroes pose as gun dealers and acrobats in order to get close to the bad guys so they can avenge the death of one of their brothers. In the end they lock the bad guys in a warehouse for a final battle to the death."},
{"Title": "Za Marksa... (2012) - full transcript", "Plot": "The film is about a clash between soviet-bred workers and wild realities of Russian capitalism. The plot is based on a real story of today's crisis when production owners sort out their problems by means of cutting workers' wages which are already low."},
{"Title": "Zabak (1962) - full transcript", "Plot": "The son of Isban-based Hasanshah, multi-linguist healer, Zabak, who was born after his parents' Haj trip, falls in love with wealthy Zainab, the daughter of Hakim-e-Alla, much to the chagrin of Mirza Qasim Beg. He complains to her father, who has both father and son arrested and humiliated. Unable to handle the sentence of shaving his head and beard, Hasanshah kills himself, and Zabak is exiled. His mother, unable to bear the separation, blinds herself. Zabak reluctantly joins a group of bandits led by Usmanshah Saudagar after preventing the sexual molestation of his daughter, Sameena. When the group comes to know that Qasim is to wed Zainab, they attack and loot the community, and Zainab is abducted by a crippled bandit. With the help of Khacharshah and Salma, Zabak helps Zainab flee from captivity and both renew their romance. But not for long - for soon Zabak will be on the run from an enraged Usmanshah, while Zainab will be abducted by Shahzada Parvez - the only son of Sultan-e-Yaman - who wants to make her his Mallika by any and all means."},
{"Title": "Zabriskie Point (1970) - full transcript", "Plot": "An epic portrait of late Sixties America, as seen through the portrayal of two of its children: anthropology student Daria (who's helping a property developer build a village in the Los Angeles desert) and dropout Mark (who's wanted by the authorities for allegedly killing a policeman during a student riot)..."},
{"Title": "Zack (1983) - full transcript", "Plot": "Zack is the story of a private investigator who, like many Christians, never considered the importance of a commitment to his own church. But Zack takes on an insurance investigation and in the process discovers a lot more than just the solution to the case."},
{"Title": "Zack and Miri Make a Porno (2008) - full transcript", "Plot": "Zack and Miri are two lifelong platonic friends who make an adult film to pay the rent of their apartment. With their friend Delaney, the couple set out for auditionees for their porn film, but in the process of filming, they realize they feel more for each other than they had before."},
{"Title": "Zack Snyder's Justice League (2021) - full transcript", "Plot": "Determined to ensure Superman's ultimate sacrifice was not in vain, Bruce Wayne aligns forces with Diana Prince with plans to recruit a team of metahumans to protect the world from an approaching threat of catastrophic proportions. The task proves more difficult than Bruce imagined, as each of the recruits must face the demons of their own pasts to transcend that which has held them back, allowing them to come together, finally forming an unprecedented league of heroes. Now united, Batman, Wonder Woman, Aquaman, Cyborg and The Flash may be too late to save the planet from Steppenwolf, DeSaad and Darkseid and their dreadful intentions."},
{"Title": "Zai jian ba shao nian (2020) - full transcript", "Plot": null},
{"Title": "Zai na he pan qing cao qing (1982) - full transcript", "Plot": "Da-Nian is a young man from Taipei. He goes to a remote village and works as a substitute teacher. He and Su-Yun, another teacher at the school, fall in love. There are several students in his class who are like the naughty \"three musketeers\", and a sad, silent boy Xiang-Wang, who's parents are divorced. Besides, in order to support the family, Xian-Wang's father kills the fish in the river with electricity, which is against the law and causes a lot of damage to the natural resources. Because of this, Xian-Wang has been teased by other school children. At last, he becomes so upset and runs away from home..."},
{"Title": "Movies with the first letter - \"Z\"", "Plot": null},
{"Title": "Zandy's Bride (1974) - full transcript", "Plot": "Zandy Allan purchases a mail-order bride, Hannah Lund. He treats her as a possession, without respect or humanity, until their shared ordeal as they struggle to survive develops in him a growing love."},
{"Title": "Zameen Aasmaan (1972) - full transcript", "Plot": "Disciplinarian Shanti Swaroop (Ashok Kumar) alienates himself from his wife Urmilla (Indrani Mukherjee); son, Ravi (Sunil Dutt), and daughter, Roopa (Yogeeta Bali). His wife passes away, and he marries another woman, Maya (also Indrani Mukherjee), who looks like his wife. Maya has an on-going affair with Heeralal \"Heera\" (Ramesh Deo) unknown to Shanti Swaroop. A fall from a staircase makes Shanti Swaroop lose his eyesight, and makes him totally dependent on his wife, and a nurse, Kalpana (Rekha). Blinded and unable to see reason clearly, he refuses to let his daughter marry Ram (Sharad) as he is poor; and asks Ravi to leave his house, when Ravi speaks out against Heera and Maya, thus leaving the ground wide open for them to attempt to initially permanently blind him, and then blame the nurse for this negligence."},
{"Title": "Zambo, King of the Jungle (1972) - full transcript", "Plot": "ZAMBO is king of the jungle! Deep in the jungles of central Africa, a lone figure moves swiftly through the trees. Often heard, sometimes seen, but never forgotten, the legend of ZAMBO is about to become real! In another life he was framed for a murder he didn't commit and left to rot in a filthy African prison, only to deftly escape into the wilderness. Friend to both man and animal, Zambo selflessly protects the African people from the oppressive forces of the outside world. As the legend of Zambo becomes too big to ignore, an expedition led by explorers Professor Woodworth, Perkins, and Juanez presents Zambo with his greatest fear: discovery. With only his strength, wits, and the help of the jungle itself, Zambo is in for the fight of his life!"},
{"Title": "Zambezia (2012) - full transcript", "Plot": "Set in a bustling bird city on the edge of the majestic Victoria Falls, \"Zambezia\" is the story of Kai - a naïve, but high-spirited young falcon who travels to the bird city of \"Zambezia\" where he discovers the truth about his origins and, in defending the city, learns how to be part of a community."},
{"Title": "Zamane Se Kya Darna (1994) - full transcript", "Plot": "Virendra Singh lives wealthy lifestyle in Bommbay, India, along with his wife, Shalini, and son, Vikram. He gambles on Diwali, loses all his money, borrows a large amount from his friend, Gajendra Singh, ends up losing this too, and returns home along with Gajendra and his brother to try and repay as much as he can. When Gajendra's brother attempts to molest Shalini, Virendra's kills him and flees. He boards a bus which meets with an accident, leaving only two survivors - himself and a young heiress named Anju. He adopts her, looks after her estate and assumes a new name, Sardar Rajpal, and becomes wealthy over time. Years later Anju has grown up and finds out about her foster father's tragic story and decides to try and re-unite this family. She posts two advertisements in Bombay's newspapers, to hire an Estate Manager, as well as asking for the whereabouts of Shalini and Vikram. Little does she know that she has opened up a Pandora's box for the advertisements were read by none other than Gajendra and his son, Shakti, who are well aware that Virendra's wife and son had both perished in a fire that engulfed their residence on that very night - and now they are poised to re-enter Virendra's life - with Shakti re-naming himself Vikram with a view of marrying Anju, inheriting her wealth and then the duo plan to kill Virendra to avenge the death of their brother and uncle respectively."},
{"Title": "Zaman (1983) - full transcript", "Plot": "An undercover inspector of the Antwerp criminal investigation unit faces problems not only in his professional life, but also at home. When he is partnered with a young, over-confident colleague, he loses control over the case in hand, a situation that further takes its toll on his marriage. He's forced to ask himself whether his job is an addiction, a hunt for people that becomes more exciting the shrewder his opponent is."},
{"Title": "Zaky Chan (2005) - full transcript", "Plot": "Zaky, a lazy young man decides to work for his father's boss as a bodyguard to protect his stubborn daughter Shereen and her little brother. Soon he becomes a part of the family and a foe for Shereen's jealous boyfriend Hazem."},
{"Title": "Zakoldovannyy malchik (1955) - full transcript", "Plot": "A naughty boy named Nils is shrunken to a small size after offending a tomte. He has to go on a voyage with geese across Lapland to fulfill the prophecy and turn back to normal."},
{"Title": "Zakliata jaskyna (2022) - full transcript", "Plot": null},
{"Title": "Zaklete rewiry (1975) - full transcript", "Plot": "A teenage country boy starts working in a restaurant of the famous Pacific Hotel in the 1930s. He soon discovers that to get promoted one needs to conform and sacrifice his dignity."},
{"Title": "Zakleté pírko (2020) - full transcript", "Plot": "In this Cinderella-like fable, a woman conjures a Prince from a bird feather. Aninka, the youngest of three sisters, deals day in and day out with her bullying siblings. When Aninka and the Prince magically fall in love, they must work to break a witch's curse together."},
{"Title": "Zakir Khan: Tathastu (2022) - full transcript", "Plot": "Tathastu starts off with a recap of moments from Zakir's life. Starting from his early school days, the performance is a ride where the audience gets a peek at the family he was born in, the characters he grew closest to and his y..."},
{"Title": "Zakir Khan: Haq Se Single (2017) - full transcript", "Plot": "In Haq Se Single, Zakir's narrative takes you through his own journey of becoming the ultimate #SakhtLaunda. The guy who's survived rejection, love, heart breaks and adulthood - who's single and proud of it."},
{"Title": "Zaï Zaï Zaï Zaï (2020) - full transcript", "Plot": "Fabrice went to the supermarket without his store's loyalty card. This serious misconduct forces him to go into hiding, as both police and media hunt him down."},
{"Title": "Zánik domu Usherú (1982) - full transcript", "Plot": "In this animated version of Edgar Allan Poe's story, a traveller arrives at the Usher mansion to find that the sibling inhabitants are living under a mysterious family curse: The brother's senses have become painfully acute, while his sister has become nearly catatonic. As the visitor's stay at the mansion continues, the effects of the curse reach their terrifying climax, and he must choose between his concern for his hosts' safety, and his own."},
{"Title": "Zanjeer (2013) - full transcript", "Plot": "The official Remake of 1973 Zanjeer. ACP Vijay is Honest police Officer who has been transferred again and again from one city to another by the system for chasing corrupt underworld goons. Mala a Beautiful girl fly from outside India to attend facebook friend marriage and things go wrong when Mala has seen a murder by Teja's Gang and refuses to co-operate. Now Teja Gang wants to kill Mala. ACP Vijay convince Mala to give a statement he gives her shelter and protect her from Teja Gang soon he realize that he has fallen in love with Mala. Sher khan an illegal car dealer become a friend of ACP Vijay who can risk his life for this friendship. The story revolves around Vijay's struggle against the system, his battle against Teja."},
{"Title": "Movies with the first letter - \"Z\"", "Plot": null},
{"Title": "Zebraman (2004) - full transcript", "Plot": "Being a failure as a teacher and a family man, Shinichi tries to escape everyday life by dressing up as \"Zebraman\", the superhero. Although the TV series was canceled after only 6 episodes, this cannot stop him from acting out his escape fantasy in a self made zebra-suit. He gets more then he could ever wish for when his black-and-white dressed alter-ego seems to be the only thing to stand between absolute (green) evil and a happy ending."},
{"Title": "Zebra in the Kitchen (1965) - full transcript", "Plot": "A young boy lets the animals out of their cages at the Zoo, to set them free, but the animals start taking over the town."},
{"Title": "Zazdrosc i medycyna (1973) - full transcript", "Plot": "In 1930s, a doctor has an affair with the wife of a wealthy industrialist in Poland."},
{"Title": "Zazda strasti (1991) - full transcript", "Plot": null},
{"Title": "Zazà (1944) - full transcript", "Plot": null},
{"Title": "Zaza (1938) - full transcript", "Plot": "A sexy singer in a French music hall falls in love with a handsome, but married, aristocrat."},
{"Title": "Zaza (1923) - full transcript", "Plot": null},
{"Title": "Zaytoun (2012) - full transcript", "Plot": "Beirut, 1982: a young Palestinian refugee helps an Israeli fighter pilot escape from PLO captivity because he wants to visit his ancestral family home. En route through war-torn Lebanon their relationship develops into a close bond."},
{"Title": "Závrat (1963) - full transcript", "Plot": "Geologists looking for tin stay at a country hotel.The manager's daughter experiences her first love."},
{"Title": "Zátopek (2021) - full transcript", "Plot": "Autumn 1968, the Australian running record holder Ron Clarke is coming to Prague, hoping that his old friend and role model, Emil Zátopek, the most famous Czech athlete of all time, will help him overcome the biggest crisis of his career."},
{"Title": "Zatoichi Meets Yojimbo (1970) - full transcript", "Plot": "With a price on his head, Ichi seeks tranquillity in a favorite village. Since his last visit, it has fallen prey to Boss Masagoro, the son of a merchant rumored to have stolen gold from the shogunate. The boss has hired Yojimbo as his hard-drinking enforcer, but Yojimbo is both a spy for the shogunate, trying to find the gold, and in love with the merchant's unwilling mistress, Umeno. Ichi hires on as the merchant's masseur and buys Umeno's freedom with his employer's own money. This embarrasses Yojimbo who withdraws from a pact with Ichi to stir up trouble between father and son and their gangs. As the two sides fight, Ichi finds the gold and sets up a final set of confrontations."},
{"Title": "Zatoichi in Desperation (1972) - full transcript", "Plot": "After accidentally causing an old lady's death, Zatoichi seeks out her daughter to atone for the tragedy, consequently getting into all sorts of trouble."},
{"Title": "Zatoichi Goes to the Fire Festival (1970) - full transcript", "Plot": "Cowritten by star Shintaro Katsu, this adventure pits Zatoichi against one of his most diabolical foes: a blind yakuza boss whose reign of terror and exploitation has made him nearly mythic. Guest starring the legendary Tatsuya Nakadai as a ronin haunted by a traumatic past, and featuring an unforgettable nude swordfight in a bathhouse, this twenty-first entry in the series is a fan favorite."},
{"Title": "Zatoichi at Large (1972) - full transcript", "Plot": "Blind masseur and master swordsman Zatoichi finds a robbed and fatally wounded pregnant woman, whose baby he delivers before she dies. He takes the baby in search of its father and finds the child's aunt, who is about to be forced into prostitution for want of a payment the dead mother was bringing. Zatoichi determines to save the woman from her fate."},
{"Title": "Zatoichi and the One-Armed Swordsman (1971) - full transcript", "Plot": "While traveling the Japanese countryside the blind masseur Zatoichi comes across the One Armed Swordsman, Wang Kang, who is in hiding and protecting a child from a corrupt Japanese priest and a group of yakuza. Zatoichi and Wang Kang, each from very different worlds yet heroic swordsman in their own right, at first seem to get along but a language barrier and a series of misunderstanding leads Kang to distrust Ichi. Soon the two heroes are at each other throats while each attempts to stop the true villains from taking the child."},
{"Title": "Zatoichi and the Fugitives (1968) - full transcript", "Plot": "Blind masseur and master swordsman Zatoichi becomes involved with a gang of bandits hiding out in a small village. While they hide in the attic of a silk mill, they manipulate the corrupt chief official of the town. Simultaneously Zatoichi tries to rescue a young woman from the sweatshop conditions of the mill. Eventually he must confront not only the leaders of the town but the outlaw gang in battle."},
{"Title": "Movies with the first letter - \"Z\"", "Plot": null},
{"Title": "Zero to Sixty (1978) - full transcript", "Plot": "A divorced man hooks up with a street-smart sixteen-year-old who makes her living by repossessing cars from their owners."},
{"Title": "Zero to Hero (2021) - full transcript", "Plot": "Biopic tribute to So Wa Wai, Hong Kong's first Paralympic athlete to win gold. Even if you start at a disadvantage, you can still be first across the finish line."},
{"Title": "Zero Pilot (1976) - full transcript", "Plot": null},
{"Title": "Zero no shôten (2009) - full transcript", "Plot": "Spurred by the disappearance of a newly-wed husband, three women in post-war Japan are drawn into a murder mystery."},
{"Title": "Zero Hour (1977) - full transcript", "Plot": null},
{"Title": "Zero Fucks Given (2021) - full transcript", "Plot": "A young flight attendant loses her job at a low-cost airline."},
{"Title": "Zero Fucks (2020) - full transcript", "Plot": "In a post-apocalyptic underground shelter, four survivors pass time in an endless orgy. When Ivanka, a murderess space woman beams in, things get kinky and spin out of control."},
{"Title": "Zero for Conduct (1933) - full transcript", "Plot": "After the holidays, Caussat and Bruel are going back to the boarding school, where their life is sad, dull, as all prisoner's ones. But there is plot setting up for a revolt..."},
{"Title": "Zero for Conduct (1949) - full transcript", "Plot": "Fotis is in love with Bilio, a last-year student at a provincial high-school, and serenades her frequently. Bilio's teacher, Platon Papadakis, is also in love with her, but besides serenading her, he also punishes her and during school breaks keeps her in the classroom. With the help of the headmistress, who is in love with Platon, the news of the love of the teacher for his student spreads throughout the small community. Platon now has to face Fotis, the headmistress and Bilio's father - who is the president of the community - who makes sure the naughty teacher is transferred and a woman teacher is appointed in his place. Platon, nevertheless, manages to return to the school dressed up as the new teacher, in order to kidnap Bilio."},
{"Title": "Zero Effect (1998) - full transcript", "Plot": "Daryl Zero is a private investigator. Along with his assistant, Steve Arlo he solves impossible crimes and puzzles. Though a master investigator, when he is not working, Zero doesn't know what to do with himself. He has no social skills, writes bad music, and drives Arlo crazy. In his latest case, Zero must find out who is blackmailing a rich executive, and when his client won't tell him, why. The only problem with this case is Zero has done something he's never done before: got emotionally involved."},
{"Title": "Zero Days (2016) - full transcript", "Plot": "Documentary detailing claims of American/Israeli jointly developed malware Stuxnet being deployed not only to destroy Iranian enrichment centrifuges but also threaten attacks against Iranian civilian infrastructure. Adresses obvious potential blowback of this possibly being deployed against the US by Iran in retaliation."},
{"Title": "Zero Dark Thirty (2012) - full transcript", "Plot": "Maya is a CIA operative whose first experience is in the interrogation of prisoners following the Al Qaeda attacks against the U.S. on the 11th September 2001. She is a reluctant participant in extreme duress applied to the detainees, but believes that the truth may only be obtained through such tactics. For several years, she is single-minded in her pursuit of leads to uncover the whereabouts of Al Qaeda's leader, Osama Bin Laden. Finally, in 2011, it appears that her work will pay off, and a U.S. Navy SEAL team is sent to kill or capture Bin Laden. But only Maya is confident Bin Laden is where she says he is."},
{"Title": "Zero Contact (2022) - full transcript", "Plot": "ZERO CONTACT follows five characters based all over the world, connected only by their devotion to the late founder and tech titan Finley Hart (played by Anthony Hopkins). Forced to work together to shut down Hart's most secret invention, a machine that is either the solution to mankind's problems or the end of life on earth."},
{"Title": "Zero 2 (2010) - full transcript", "Plot": "When the under-worlds of crime and show-biz collide, hit-men buddies Max and Sylvester are suddenly thrown in the midst of bizarre events and soap-like drama. Faced with the onslaught of sleazy intrigues and silicon boobs, friends must still complete their task - retrieve a missing shipment of drugs. And then, there's also a kidnapped delivery boy to save, loads of people to kill, dangerous women to love. The trick is not to lose your head. Or your balls. Whichever goes first."},
{"Title": "Zero (2018) - full transcript", "Plot": "The story revolves around Bauua Singh (Shah Rukh Khan), a vertically challenged man, who is full of charm and wit, with a pinch of arrogance. Born to a wealthy family and raised in an environment of affluence, he is challenged to broaden his horizon and find purpose in life."},
{"Title": "Zenská na vrcholu (2019) - full transcript", "Plot": "When natural elements turn Christmas vacation into involuntary prison at an mountain hut and the children decide to take their parent's fate into their own hands, a romantic comedy can start."},
{"Title": "Movies with the first letter - \"Z\"", "Plot": null},
{"Title": "Zimowy zmierzch (1957) - full transcript", "Plot": "Rumsza, the elderly railwayman, leading a sedate life with his wife, misses his only remaining son (two older boys were killed in the war). Joziuk finally returns from the military in the first scene but with the pregnant Zosia, while Rumsza expected him to marry Celinka, the daughter of Krywka, his only friend and neighbor. The hero will not accept the new situation; he throws his son and Zosia out of his house. Celinka is distressed but she still harbors hope for Joziuk. The birth of the child changes the situation: Rumsza accepts his son's relationship but Celinka decides to leave."},
{"Title": "Zimnyaya vishnya (1985) - full transcript", "Plot": "Olga, is a young intelligent woman who raises a young son. She ends up falling in love with a married man who does not dare to leave his family."},
{"Title": "Zigs (2001) - full transcript", "Plot": "Four young compulsive gamblers come up with a radical plan to get out of debt with a fixed game."},
{"Title": "Ziggy Stardust and the Spiders from Mars (1979) - full transcript", "Plot": "The July 3rd, 1973 historic concert of the 'leper Messiah'. This was to be David Bowie's last concert with the Ziggy persona and the Spiders from Mars. A great medley of 'Wild Eyed Boy From Freecloud'/'All The Young Dudes'/'Oh! You Pretty Things', a Lou Reed cover, and a Rolling Stones cover are but some of the highlights."},
{"Title": "Zift (2008) - full transcript", "Plot": "Moth is freed on parole after spending time in prison on wrongful conviction of murder. Jailed shortly before the Bulgarian communist coup of 1944, he now finds himself in a new and alien world - the totalitarian Sofia of the 60s. His first night of freedom draws the map of a diabolical city full of decaying neighborhoods, gloomy streets and a bizarre parade of characters."},
{"Title": "Ziddi (1997) - full transcript", "Plot": "Omnipresent Bollywood acting dynamo Sunny Deol stars as Deva, the son of an honest lawyer (Anupam Kher) who lives with his brother, Aakash (Sachin Khedekar), and his beloved sister, Guddi (Richa Behl). Imprisoned after a man touches Guddi and sets off his violent, jealous rage, Deva falls into a life of crime, quickly rising to the top of the city's criminal underworld--much to the chagrin of the other crime bosses, who plot his murder. Their attempt to frame him for the murder of an important Minister doesn't go as planned, and Deva suddenly finds himself on the run, with the minister as a hostage, and his brother and sister murdered."},
{"Title": "Zid (1994) - full transcript", "Plot": "Jay is the only child and has been brought up with his grandmother, who pampers him, and never refuses him anything. When Jay wants a horse, she gets one, and he names it \"Didaara\". But Jay's love for the horse becomes a obsession, he becomes an ardent though inexperienced rider, and suffers an injury. His grandmother decides that it is time that she gave away Dildaara. When Jay finds that his horse is missing, he confronts his grandmother, and is shocked to learn that she has given away his horse. His grandmother does not know that by giving away his horse, she has changed her's and his lives forever - for Jay leaves and never returns. But how can Jay, a young man, without any skills, survive any single day without his grandmother's support?"},
{"Title": "Zi gu ying xiong chu shao nian (1983) - full transcript", "Plot": null},
{"Title": "Zhui xiong 20 nian (1998) - full transcript", "Plot": null},
{"Title": "Zhuang zhi xiong xin (1989) - full transcript", "Plot": null},
{"Title": "Zhuang zhi hao qing (1990) - full transcript", "Plot": "Chung and Kin grow up together at Rennie Mill Area with quite different characters. They were admitted into the Whampoa Military Training School at Taiwan."},
{"Title": "Zhong hua zhan shi (1987) - full transcript", "Plot": "Action film about Chinese resistance after Japanese invasion in 1930's"},
{"Title": "Zhong gui (1983) - full transcript", "Plot": "A Hong Kong taxi driver suffers after being cursed by a sorcerer he accidentally hit with his cab. After the driver's wife is raped and killed by teenage hooligans, he pleads with the sorcerer to lift the hex and restore his wife to the land of the living. Otherworldly zombie chaos ensues."},
{"Title": "Zhenitba Balzaminova (1965) - full transcript", "Plot": "Listening to the sweet sound of the crazy old woman's song \"Dobraya, dobraya!\" curly dreamer can't decide to marry."},
{"Title": "Zheng hong qi xia (1991) - full transcript", "Plot": null},
{"Title": "Zhen jia ji gong (1955) - full transcript", "Plot": null},
{"Title": "Movies with the first letter - \"Z\"", "Plot": null},
{"Title": "Zolotoe pyoryshko (1960) - full transcript", "Plot": null},
{"Title": "Zolotaya antilopa (1955) - full transcript", "Plot": "A poor Indian boy saves a magic antelope that can produce gold with its hooves. After a greedy Raja learns about it, he orders to bring him the antelope - or die."},
{"Title": "Zokki (2020) - full transcript", "Plot": "Three of Japan's most talented and prolific actor-directors have joined forces to adapt Hiroyuki Ohashi's cult manga series about characters in \"an obscure corner\" of the world. The film's five loosely connected storylines concern the secrets and lies, the fears and tears, and the puerile potty jokes that punctuate their daily (and in one eerie case, nightly) encounters."},
{"Title": "Zoids Genesis (2005) - full transcript", "Plot": null},
{"Title": "Zog and the Flying Doctors (2020) - full transcript", "Plot": "Pearl and Gadabout are now a flying doctor trio, caring for creatures including a mermaid, a unicorn and a sneezy lion. However when bad weather forces them to land at the palace, Pearl is locked up by her uncle, the king."},
{"Title": "Zog (2018) - full transcript", "Plot": "A keen but accident-prone dragon learns how to become a dragon at Dragon School."},
{"Title": "Zoey's Extraordinary Christmas (2021) - full transcript", "Plot": "On her first holiday without her father, Zoey wants to create a magical Christmas for her family just like the ones Mitch used to do."},
{"Title": "Zoey's Extraordinary Christmas (2021) - full transcript", "Plot": "On her first holiday without her father, Zoey wants to create a magical Christmas for her family just like the ones Mitch used to do."},
{"Title": "Zoey (2020) - full transcript", "Plot": "After losing his job, Tommy heads back to his home town of New York City. With zero job prospects, Tommy starts selling cocaine with Donnie, his brother, a veteran drug dealer. Tommy keeps ..."},
{"Title": "Zoe (2018) - full transcript", "Plot": "A story about how synthetic humans can feel and even love, and how the people they are involved with react to this concept."},
{"Title": "Zodiac (2007) - full transcript", "Plot": "A serial killer in the San Francisco Bay Area taunts police with his letters and cryptic messages. We follow the investigators and reporters in this lightly fictionalized account of the true 1970's case as they search for the murderer, becoming obsessed with the case. Based on Robert Graysmith's book, the movie's focus is the lives and careers of the detectives and newspaper people."},
{"Title": "Zo Reken (2021) - full transcript", "Plot": "Zo reken (\"shark bone\") is the nickname given in Haiti to the Toyota Land Cruiser, a powerful 4x4 vehicle popular among the humanitarian aid organizations that are omnipresent in the country since the 2010 earthquake. Ten years later, as the country is once more in turmoil and under a strict lockdown, a zo reken has been hacked and transformed into a mobile space for encounters and discussion among Haitians. Foreign aid workers are no longer allowed on board. The driver leads the conversation with his passengers, all citizens of Port-au-Prince, as he tries to make his way between the barricades and the demonstrations. They talk about the state of the country, about neocolonialism and humanitarian aid, and anger is mounting. They're angry at the president who lost the people's confidence, frustrated by the international community that made promises that were never kept, and desperate to see the end of the violence against the most vulnerable. Zo reken is a road movie and a machine that makes them speak."},
{"Title": "Znachor (1937) - full transcript", "Plot": null},
{"Title": "ZMD: Zombies of Mass Destruction (2009) - full transcript", "Plot": "Life is wonderful for the people in the quiet, island town of Port Gamble....until a zombie virus outbreak!"},
{"Title": "Zlota Mahmudia (1987) - full transcript", "Plot": "Two youngsters vacationing at the Black Sea sneak onto a mysterious ship and spy the peculiar activities of a treasure-seeking crew. They are discovered and imprisoned as the ship heads for an uncharted island. Their parents put together an expedition and after numerous adventures the treasure hunters are apprehended and the mystery of a secret cove is solved."},
{"Title": "Zlatý podraz (2018) - full transcript", "Plot": null},
{"Title": "Movies with the first letter - \"Z\"", "Plot": null},
{"Title": "Zombies of the Stratosphere (1952) - full transcript", "Plot": "Security agent Larry Martin, who can fly with an experimental rocket suit, investigates clandestine visits to earth by a Martian spaceship. Meanwhile, villainous Martians conspire with a traitorous atomic scientist to blast earth out of its orbit and replace it with Mars! Can Larry and his cohort Bob Wilson stop the Martians before they complete their dastardly project? Not a zombie in sight."},
{"Title": "Zombies of Mora Tau (1957) - full transcript", "Plot": "Zombiefied sailors guard the treasure of a ship they went down with 60 years earlier. A group of sailors scoff at the legend, and decide to retrieve the diamonds from the ocean floor only to discover the hard way that there is some truth to legends."},
{"Title": "Zombies 3 (2022) - full transcript", "Plot": "Zed anticipates an athletic scholarship while Addison is gearing up for Seabrook's international cheer-off competition. Then suddenly, extraterrestrial beings appear around Seabrook, causing more than friendly competition."},
{"Title": "Zombiepura (2018) - full transcript", "Plot": "When a mysterious virus breaks out in an isolated army camp, a lazy reservist soldier and his tough commander must work together to survive, and learn what it means to be real soldiers."},
{"Title": "Zombieland: Double Tap (2019) - full transcript", "Plot": "Columbus, Tallahassee, Wichita, and Little Rock move to the American heartland as they face off against evolved zombies, fellow survivors, and the growing pains of the snarky makeshift family."},
{"Title": "Zombieland (2009) - full transcript", "Plot": "Searching for family. In the early twenty-first century, zombies have taken over America. A shy and inexperienced college student in Texas has survived by following his 30 rules: such as \"look in the back seat,\" \"double-tap,\" \"avoid public restrooms.\" He decides to travel to Ohio to see if his parents are alive. He gets a ride with a boisterous zombie-hating good-old boy headed for Florida, and soon they confront a young woman whose sister has been bitten by a zombie and wants to be put out of her misery. The sisters were headed to an LA amusement park they've heard is zombie free. Can the kid from Ohio get to his family? And what about rule thirty one?"},
{"Title": "Zombiechrist (2010) - full transcript", "Plot": "Druids resurrect the partially mummified remains of Jesus. They force the zombified Christ to commit unspeakable acts as their sect prepares to rule a new age of mankind."},
{"Title": "Zombie Tidal Wave (2019) - full transcript", "Plot": "A fisherman contends with an ocean-borne outbreak that threatens his seaside island community."},
{"Title": "Zombie Spring Breakers (2016) - full transcript", "Plot": "A group of young people head to Ibiza for the holiday of a lifetime - all the sun, sea, and sex, they can handle. If only there wasn't a zombie outbreak getting in the way."},
{"Title": "Zombie Ninjas vs Black Ops (2015) - full transcript", "Plot": "In the clandestine research tower of a ruthless Japanese security and arms company, Saisei Security, scientist MALI awakens employed mercenaries killed in combat, their death giving rise to a new, vicious breed of zombie... ZOMBIE NINJAS. Trapped amongst unsuspecting civilians, including former tactical operative DILLON (Adam T Perkins), the ZOMBIE NINJAS commanded by a ferocious leader (Soa 'The Hulk' Palelei) are unleashed in the inner city high-rise. They soon face off with the covert response mission deployed to fight back. This elite black ops team underestimates the brutality of their encounter, which ultimately tests their loyalty and friendship, resulting in a frightful assault between these two highly skilled lethal forces and DILLON thrust in the middle fighting for survival."},
{"Title": "Zombie Massacre (2013) - full transcript", "Plot": "A bacteriological weapon developed by the US Government to create a super soldier - spreads an epidemic in a quiet little town in the middle of Eastern Europe. All citizens have been turned into infected zombies. The plan is to bring an atomic bomb into the city's nuclear plant to pretend a terrible accident occurred. No one has to know the truth. A team of mercenaries is hired to complete the mission. The battle is on. Hordes of monsters against the team. WHO WILL SURVIVE?"},
{"Title": "Zombie Lake (1981) - full transcript", "Plot": "In a small village, somewhere in France, German soldiers, killed and thrown into the lake by the Resistance during WW II, come back."},
{"Title": "Zombie Island Massacre (1984) - full transcript", "Plot": "Americans on vacation in the Caribbean take a tour of a nearby island at night and watch a local voodoo ritual. Soon after, they find themselves stranded on the island and under attack by unseen foes. One by one they meet violent ends."},
{"Title": "Zombie Hamlet (2012) - full transcript", "Plot": "Desperate filmmaker Osric Taylor dreams of making his civil war Hamlet but when production funding dries up, he agrees to take southern matron Hester Beauchamps offer to fund the film if he throws some zombies in it to make their money back. But when Hester dies in mid shoot, Osric dresses up as Hester to cash the last check and awakens the suspicions of both the local police and ambitious local news reporter Shine Reynolds. Inspired by an actual incident."},
{"Title": "Zombie Bro (2016) - full transcript", "Plot": "Zombie Bro is a kids comedy feature film about a little girl whose brother is a zombie, but nobody else seems to notice."},
{"Title": "Zombie Bride (2013) - full transcript", "Plot": null},
{"Title": "Movies with the first letter - \"Z\"", "Plot": null},
{"Title": "Zrodzeni do szabli (2019) - full transcript", "Plot": "Set in Poland during the first half of XVII century, the epic documentary-drama \"Born for the saber\" tells the story of young knight Blazej Wronowski. Jan Jerlicz, a veteran of the ..."},
{"Title": "Zrcadlení (1966) - full transcript", "Plot": "A documentary about hospital patients, staff, and doctors."},
{"Title": "Zouzou (1934) - full transcript", "Plot": "As children, Zouzou and Jean are paired in a traveling circus as twins: she's dark, he's light. After they've grown, he treats her as if she were his sister, but she's in love with him. In Paris, he's a music hall electrician, she's a laundress who delivers clean underwear to the hall. She introduces him to Claire, her friend at work, and the couple fall in love. Jean conspires to get the show's star out of town and for the theater manager to see the high-spirited Zouzou perform. When Jean's accused of murder and Zouzou needs money to mount his defense, she pleads to go on stage. Her talents may save the show, but can anything save her dream of life with Jean?"},
{"Title": "Zotz! (1962) - full transcript", "Plot": "Jonathan Jones, a professor of ancient languages, comes into possession of an ancient coin. He translates its inscription, which gives him three powers: to inflict pain, slow down time or kill. Soon, he's pursued by enemy spies who have learned about the magic coin."},
{"Title": "Zot van A. (2010) - full transcript", "Plot": "Anna breaks up with Bruno after he has cheated on her with their son Boris's schoolteacher. But her far too young lover can only temporarily offer distraction. Arno and her best friend Lydia's marriage, on the other hand, looks like the perfect marriage. But is it...? Between Alain and Fred all is roses: they are going to get married, or is the party over after all?"},
{"Title": "Zorro (1975) - full transcript", "Plot": "A newly arrived governor finds his province under the control of the corrupt Colonel Huerta. To avoid assassination by Huerta, he pretends to be weak and indecisive so Huerta will believe he poses no threat. But secretly he masquerades as Zorro, and joins the monk Francisco and the beautiful aristocrat Ortensia in their fight for justice against Huerta and his soldiers."},
{"Title": "Zoroastre (2006) - full transcript", "Plot": null},
{"Title": "Zorba the Greek (1964) - full transcript", "Plot": "An aimless English writer finds he has a small inheritance on a Greek island. His joyless existence is disturbed when he meets Zorba, a middle aged Greek with a real lust for life. As he discovers the earthy pleasures of Greece, the Englishman finds his view on life changing."},
{"Title": "Zootopia (2016) - full transcript", "Plot": "From the largest elephant to the smallest shrew, the city of Zootopia is a mammal metropolis where various animals live and thrive. When Judy Hopps becomes the first rabbit to join the police force, she quickly learns how tough it is to enforce the law. Determined to prove herself, Judy jumps at the opportunity to solve a mysterious case. Unfortunately, that means working with Nick Wilde, a wily fox who makes her job even harder."},
{"Title": "Zoot Suit (1981) - full transcript", "Plot": "A kind of musical accompanying the story of the early 1940's and the effect that the \"zoot suit\" (a man's suit of long jacket and pegged pants, always worn with a long keychain that looped almost to the ankle.... the rebellious fashion of young men) had on the morals and attitudes of the people of that era."},
{"Title": "Zoombies 2 (2019) - full transcript", "Plot": "A game ranger and a team of poachers end up surrounded by zombie animals and they forge an alliance to stop the beasts before the super-zombie virus spreads to the entire world."},
{"Title": "Zoom Up: Rape Site (1979) - full transcript", "Plot": null},
{"Title": "Zoom (2006) - full transcript", "Plot": "Former superhero Jack Shepard, (also known as Captain Zoom), is called back to work to transform an unlikely group of ragtag kids into a new generation of superheroes at a privacy Academy and save the world from certain destruction. The project holds an audition of would-be members, most of whom possess useless or disgusting powers. In the end, Dylan, a 17-year-old boy who can turn invisible Summer, a 16-year-old girl with telekinetic powers Tucker, a 12-year-old boy with the power to enlarge any part of his body Cindy, a 6-year-old girl with super strength."},
{"Title": "Zoolander (2001) - full transcript", "Plot": "Derek Zoolander is VH1's three time male model of the year, but when Hansel wins the award instead, Zoolander's world becomes upside down. His friends disappear, his father is disappointed in him, and he feels that he's not good as a model anymore. But when evil fashion guru Mugatu hires Zoolander, he thinks his life has turned back round again, that is until he finds out that Mugatu has actually brainwashed him to kill the Prime Minister of Malaysia. Can Zoolander and his new friends find out how to prevent the incident before it's too late?"},
{"Title": "Zookeeper (2011) - full transcript", "Plot": "A group of zoo animals decide to break their code of silence in order to help their lovable zoo keeper find love -- without opting to leave his current job for something more illustrious."},
{"Title": "Zooey & Adam (2009) - full transcript", "Plot": "Adam and Zooey have been trying to have a baby for several months, only to end up pregnant after a rape. Unsure of the parentage of their child, they decide to have the baby anyway."},
{"Title": "Movies with the first letter - \"Z\"", "Plot": null},
{"Title": "Zygote (2017) - full transcript", "Plot": "In a remote mining facility located somewhere in the Arctic circle, a monster kills 96 of the 98 people there. The 2 remaining survivors try to hide from it, but with food and water running low, they decide to escape to a safe zone as it contains an abundance of supplies. As soon as they leave, however, they are instantly pursued by the monster through large rooms and narrow corridors with only a couple of guns to defend themselves with."},
{"Title": "Zygfryd (1986) - full transcript", "Plot": "Set in 1936 in Poland. Zygfryd, a handsome, orphaned young circus acrobat with an introspective temperament, is under the protection of circus owner, Waldo, and his wife. A rich intellectual recluse, patron of the arts (and of young artists) stumbles into Zygfryd's heart- stopping act and offers him his friendship. He also opens up his cultural horizons and teaches him to consciously reflect on life. It all ends in tragedy, when the boy finds that the circus life is no longer enough and falls during his act."},
{"Title": "Zydrasis Horizontas (1958) - full transcript", "Plot": null},
{"Title": "Zwolnieni z zycia (1992) - full transcript", "Plot": "Set in 1989, story of a man beat up by two ex-policemen and left to die in a dump. Marek survives after the brain surgery that leaves him amnesiac. He wanders through the city, sought by his assilant, who fear he will testify against them. Marek finds shelter with a girlfriend/bagwoman who supposedly was once queen of Paris boulevards. Marek regains his memory just as the villains are to get him. He eventually returns to his house only to find out that his mother died and his brother left for Australia."},
{"Title": "Zwischen Sommer und Herbst (2018) - full transcript", "Plot": null},
{"Title": "Zwischen gestern und morgen (1947) - full transcript", "Plot": "A group of people gathers back in the post-war ruins of a luxurious Munich hotel they inhabited at one point or another years before; each trying to cope with the tragic consequences of the war and their own actions."},
{"Title": "Zwinglis Erbe (2018) - full transcript", "Plot": "A.D. 1519: When Huldrych Zwingli begins preaching as a priest in Zurich, the plague affects him. Looking death in the face, God's Word carries him through and he survives. Encouraged, he turns Zurich upside down with the Bible in his hand."},
{"Title": "Zweisam gemeinsam einsam (2018) - full transcript", "Plot": "Two cousins, Wanda and Dora, are heading to their family's weekend retreat with Dora's boyfriend, Anton, and his friend Lukas. They're unaware that the relaxing weekend they have planned ..."},
{"Title": "Zwei in einem Boot (1999) - full transcript", "Plot": "Three children and their Grandpa are on a kayak-outdoor trip in the middle of nowhere. What was supposed to be a relaxed summer weekend with some nice small adventures turns into serious trouble when their Grandpa suffers a heart attack in the middle of the wilderness. Nobody can hear the children screaming, the mobile phone has no net, nobody is in sight or even close. The children are completely on their own - with an old man in a small boat who does not move any more and is barely breathing. To rescue themselves and their Grandpa the children have to fight their way back to civilization ..."},
{"Title": "Zwei Herzen im Dreiviertel-Takt (1930) - full transcript", "Plot": "Toni Hofer and brothers Vicki and Nicki Mahler are working on a new operetta. Toni's reputation with women equals his fame as composer, so they keep their sister Hedi away from him. Wanting to know him, she calls at his house in the middle of the night not revealing her identity, helps him write the main waltz theme and disappears, leaving him incapable of remembering his greatest melody. Music by Robert Stolz."},
{"Title": "Zvezda plenitelnogo schastya (1975) - full transcript", "Plot": "In December 1825, distinguished members of the Russian military, most of whom were quite affluent and of noble lineage, took it upon themselves to stir revolution against the autocratic and tyrannical Czar Nikolai I in the wake of his not honoring (or even acknowledging) the drafting of a constitution for the Russian people. The revolution failed miserably and the conspirators (known as the Decembrists) were weeded out by the czar himself. One by one, each of the conspirators confess and are systematically exiled to the harsh winters of Siberia, slated to work and wither in a prison/mine. The wives of the conspirators are faced with the prospect of leaving the bosom of wealth and family (including their own children) to be with their husbands in the brutal Siberian locale. If they agree to this, they face having their illustrious social stations stripped away and certain disdain from everyone around them. Among these remarkable women is a princess exiled from France who falls in love with a man soon to be exiled. The film is the story of their unfathomable sacrifice and their dogged desire to be reunited with the men they love, despite the conditions and the circumstances."},
{"Title": "Zvahlav aneb Saticky Slameného Huberta (1971) - full transcript", "Plot": "In stop-time animation, a wardrobe moves through the countryside. It arrives in a house, a child's voice recites Lewis Carroll's \"Jabberwocky,\" and various objects, such as toys and dolls, move about, disintegrate, and play out archetypal scenes. Like Carroll's verse, the images are at once familiar and unfamiliar. A child's play suit, hanging in the wardrobe, becomes the adventure's protagonist."},
{"Title": "Zuzel (2020) - full transcript", "Plot": "Lova (Tomasz Zietek), a young and handsome motorcycle speedway champion, fights his troubles and fears, haunting him both at home and at the track. His close-to-poverty life becomes even more difficult as he meets Roma (Jagoda Porebska)."},
{"Title": "Zutto Dokushin de Iru Tsomori? (2021) - full transcript", "Plot": "Mami is 36 and unmarried, but with a job she loves and great friends, does she really need a man in her life to find happiness?"},
{"Title": "Zus & zo (2001) - full transcript", "Plot": "A fun story about a family of 3 sisters whose gay brother, Nino, has decided to marry a woman in order to inherit their childhood summer retreat (Hotel Paraiso) on the coast of Portugal. The sisters plot to sabotage the engagement so as to save the hotel for themselves."},
{"Title": "Zupa nic (2021) - full transcript", "Plot": "Marta is a romantic and a school victim of fate. He shares a room with his sister Kasia and grandmother, who tells her granddaughters insurgent stories instead of fairy tales. In the room behind the wall, my parents - Tadek and Elzbieta - live their married life. He is a constantly humiliated intelligent by the system who silently envies his prosperous brother-in-law. She is the president of the company's \"Solidarity\" with the need for freedom and a dream to finally break out of Poland. However, the real emotions for the whole family will start when the dream orange toddler stands under the block. It will turn out to be an unexpected catapult to the big world - the family will go to Lake Balaton with a toddler with luggage on the roof. Ela and Tadek will discover a vocation to trade and travel abroad, and the growing up Marta will fall in love again."},
{"Title": "ZZ Top: That Little Ol' Band from Texas (2019) - full transcript", "Plot": "The story of how three oddball teenage bluesmen became one of the biggest, most beloved bands on the planet."},
{"Title": "ZZ Top: Live from Texas (2008) - full transcript", "Plot": "Filmed in their home state of Texas in front of a wildly enthusiastic audience, this film captures ZZ Top at their very best."},
{"Title": "ZZ Top: Live at Montreux 2013 (2014) - full transcript", "Plot": "With an unchanged line-up stretching back to 1969 and global album sales in excess of 50 million, ZZ Top continue to delight fans around the world with brilliant live concerts and great music. The band has made a number of visits to Montreux over the years and this concert from the 2013 Festival is undoubtedly one of their finest live performances. The set list blends tracks from early seventies albums such as \"Tres Hombres\" and \"Fandango\" through their eighties blockbuster period with \"Eliminator\" and \"Afterburner\" and up to their most recent release and return to their blues roots with \"La Futura\". The middle section of the concert features a jazz-blues tribute to the late Montreux Festival founder Claude Nobs with guest appearances by Mike Flanigin on Hammond Organ and Van Wilks on guitar. ZZ Top, the \"lil' ol' band from Texas\", are rocking the blues as strongly as ever!"},
{"Title": "Zuo Er (2015) - full transcript", "Plot": "Li, a shy girl with hearing loss in her left ear, musters the courage to express her love to Xe Ge, but Xe Ge starts dating Bala, until a tragic incident brings him and Li together."},
{"Title": "Zum zweiten Frühstück heiße Liebe (1972) - full transcript", "Plot": "A reporter begins research on a story involving married European women and their secret fantasies and desires."},
{"Title": "Zum zum zum n° 2 (1969) - full transcript", "Plot": "Tony, who is engaged to Rosalia, falls in love with the spectacular Valeria and problems ensue."},
{"Title": "Zum zum zum - La canzone che mi passa per la testa (1969) - full transcript", "Plot": "An insurance broker who is very fond of music has two sons. The older is in love with a Sicilian girl whose father is against their love; the younger is a disgrace to his father because, of all things, he got a very low mark in music at school."},
{"Title": "Zulu Dawn (1979) - full transcript", "Plot": "In 1879 South Africa, the administrators of the British Cape Colony have designs to eliminate the Zulus as a hindrance to their colonial economy. To that end, the British present King Cetshwayo with an impossible ultimatum to provoke a war they are sure they can win easily with their rifles and artillery against native spears. However, that war proves more difficult than the arrogant British commander, Lord Chelmsford, expects as his overburdened army fruitlessly searches for the elusive enemy. However, in the shadow of a hill called Isandlwana, the overconfident British army learns to its sorrow just how badly they have underestimated the tactical skill and might of the Zulu nation."},
{"Title": "Zulu (1964) - full transcript", "Plot": "Zululand, South Africa, 1879. The British are fighting the Zulus and one of their columns has just been wiped out at Isandlwana. The Zulus next fix their sights on the small British outpost at Rorke's Drift. At the outpost are 150 British troops under the command of Lieutenants Bromhead and Chard. In the next few days these 150 troops will fight about 4,000 Zulus in one of the most courageous battles in history."},
{"Title": "Zulm Ka Badla (1985) - full transcript", "Plot": "Young and attractive Geeta lives a fairly wealthy lifestyle along with her mom - Savitri, dad - Colonel Rajesh, and brother - Bunty. The family decide to have a get together with the Verma family, which consists of Police Inspector Verma, his wife, and son, Anil. When the Vermas get to Rajesh's residence, they find the house in flames, a traumatized Geeta, the charred remains of her parents, and Bunty missing. Verma takes Geeta home, adopts her, and does not her know that her parents were brutally murdered for fear of traumatizing her even more. Years later Anil has grown up and is now a Police Inspector, while his dad is the D.I.G.. Anil and Geeta fall in love and get married. Then Anil is assigned the murder case of an underworld gangster, Rana. Before he could even conclude his investigation, another gangster, Pinto, is killed. Both Anil and his dad suspect that Geeta may have had a hand in their killing but are unable to prove anything yet decide to keep an eye on her. Geeta subsequently gets pregnant followed by the brutal killing of another gangster, Jagdish Kumar. Anil and his dad confront Geeta but she manages to escape, dons the disguise of a nun, calls herself Mrs. D'Sa, and decides to hunt down the final killer of her family - Sangram Singh. Now visibly pregnant she must now confront a hit-man named Shambhu as well as be on the run from her husband, her father-in-law, the entire Police Force, as well as locate the elusive Sangram, who is believed to be in jail for another murder. The question remains who will assist Geeta, and how will she finally avenge the death of her parents?"},
{"Title": "Zulfiqar (2016) - full transcript", "Plot": "A modern day adaptation of two of William Shakespeare's tragedies - Julius Caesar and Antony and Cleopatra."},
{"Title": "Zui ai (1986) - full transcript", "Plot": null},
{"Title": "Zubekô banchô: Tôkyô nagaremono (1970) - full transcript", "Plot": null},
{"Title": "Zu: Warriors from the Magic Mountain (1983) - full transcript", "Plot": "Chinese soldiers in an ancient civil war get caught up in a fantastical quest to save the universe."},
{"Title": "Zu weit weg (2019) - full transcript", "Plot": null},
{"Title": "Zu nah am Feuer (2002) - full transcript", "Plot": "Successful husband, clever children, great job - the lawyer Eva lacks nothing. Except the erotic tingle that she and Richard, a writer have lost in their family life. She realizes that she ..."},
{"Title": "ZsaZsa Zaturnnah Ze Moveeh (2006) - full transcript", "Plot": "After experiencing heartache, Adrian a.k.a. Ada - a conservative homosexual, leaves the city with his cousin Aruba. Relocating to a quaint province to start a new life and a parlor business, she meets her assistant Didi, her new secret love Dodong and a multitude of wacky characters including Dodong's brother Poldo, the peculiar couple Aling Britney and Mang Justin and her arch-rival when it comes to Dodong's affections Krystal. When a mysterious stone engraved with the words \"Zaturnnah\" falls from the sky one night, Ada gulps it down and he is magically transformed into Zsa Zsa Zaturnnah, a super heroine with immense strength and extraordinary beauty. In the pursuit of liberty, truth, justice and loads of excellent hair coloring, she fearlessly defends her newfound home from a giant frog, zombies running amok and from the overbearing Amazonistas from Planet X led by man-hater Queen Femina."},
{"Title": "Zoo-Head (2018) - full transcript", "Plot": "Charlie is a zoo-head, addicted to powerful hallucinogens that have memory destroying side-effects. He is forced to enter an experimental rehabilitation program that involves memory looping..."},
{"Title": "Zoo Wars 2 (2019) - full transcript", "Plot": "In the wake of a truce between the Nice Side and the Mice Side, the Zooverse has settled into an era of peace. The villainous mouse, Boo Boo Squeal, is determined to violate that peace ..."},
{"Title": "Zoo (1993) - full transcript", "Plot": null},
{"Title": "Zoo (2018) - full transcript", "Plot": "A couple try to save their marriage during a zombie apocalypse."},
{"Title": "Zoo (2017) - full transcript", "Plot": "Young Tom Hall (Art Parkinson) and his misfit friends fight to save \"Buster\" the baby elephant during the German air raid bombings of Belfast, Northern Ireland in 1941."},
{"Title": "Zontar: The Thing from Venus (1966) - full transcript", "Plot": "A misguided scientist enables an alien from Venus named Zontar to come to earth in order to help solve man's problems. However, Zontar has other ideas, like disabling the power supply of the entire world and taking possession of important officials with mind control devices."},
{"Title": "Zone Troopers (1985) - full transcript", "Plot": "In Italy during WW II, a patrol of American soldiers discover a space ship that has crash-landed in the woods, and they come across its alien crew. A nearby Nazi unit also finds out about the alien craft, and sends a patrol to capture it and the Americans."},
{"Title": "Zone 414 (2021) - full transcript", "Plot": "Set in the near future in a colony of state-of-the-art humanoid robots. When its creator's daughter goes missing, he hires private investigator David Carmichael, to bring her home. David teams up with Jane, a highly advanced and self-aware A.I., to track down the missing daughter. Moving through the dangerous iron jungle, they rapidly piece together the mystery, uncovering a crime that leads them to question the origins of Zone 414 and the true purpose behind the \"City of Robots.\""},
{"Title": "Zona Zamfirova (2002) - full transcript", "Plot": "The plot follows the story of Zona Zamfirova (Katarina Radivojevic), a local rich man's daughter, and the vicissitudes of her affair with Mane (Vojin Cetkovic), an ordinary goldsmith. As it was undesirable for the daughter of a rich man to marry a craftsman, the two are at first divided, with the possibility of Zona marrying the son of other rich people, Manulac. Everything is, however, changed as Mane organizes a successful conspiracy to keep Zona for himself."},
{"Title": "Zomblogalypse (2022) - full transcript", "Plot": "Feature length adaptation of the cult British zom-com web series following the adventures of three inept survivors of a zombie apocalypse through a video blog they maintain to ease the boredom of day to day survival."},
{"Title": "Zombivli (2022) - full transcript", "Plot": "In the suburban neighborhood of Mumbai, a wall separates the haves and the have-nots. Sudhir and Seema, a newly married middle class couple, live a life without hardship while Vishwas, a slum dweller, dreams of dignity for his people. Their lives collide as post nightfall the town fills up with ominous cries and moans that don't belong to people - they belong to zombies ."},
{"Title": "Zombillénium (2017) - full transcript", "Plot": "Zombillenium, the Halloween theme park, happens to be the one place on earth where real monsters can hide in plain sight. When Hector, a human, threatens to disclose the true identity of ..."},
{"Title": "Zombies Vs. Strippers (2012) - full transcript", "Plot": "The Tough Titty is a strip club that's seen better days. Spider has been losing money on his business for years. Now it's finally getting the traffic he's always wanted... unfortunately, most of his patrons are undead."},
{"Title": "Zombies on Broadway (1945) - full transcript", "Plot": "Two inept press agents are ordered to the island of San Sebastian to get a zombie for an opening night publicity stunt of a nightclub. They find a likely source in Dr. Paul Renault, who has spent much time studying (and experimenting) on the subject, but Renault has other ideas."},
{"Title": "Zombie at 17 (2018) - full transcript", "Plot": "Zombie at 17 follows Tia Scott, a normal 17-year-old girl. Her life had changed after her elder sister died in a hit and run accident recently. But if that was a life altering event, the ..."},
{"Title": "Zombie Army (1991) - full transcript", "Plot": "When the Army takes over a former asylum, they discover that some inmates are still living in solitary confinement there, and become murderous zombies."},
{"Title": "Zombie Apocalypse (2011) - full transcript", "Plot": "Three small groups of survivors of a zombie plague join forces to reach the ferry boat to a sanctuary that they are not sure that it does exist in the Catalina Island. Along their journey, they are hunted down by hordes of zombies and only a few of them survive."},
{"Title": "Zombie 5: Killing Birds (1987) - full transcript", "Plot": "In Louisiana, a soldier returning from Vietnam finds his wife in bed with her lover and he kills them both as well as a couple of friends, but he is attacked by a bird and he loses his eyes. Years later, the bodies have not been found and the former soldier is now a bird specialist (Dr. Fred Brown) living in a house nearby the swamp. When a group of college students go to the swamp on an assignment to research a species of woodpecker that is almost extinct, they head to Dr. Brown's house to get some tips of how to find the rare bird. They drive through the swamp where they find the house where the murders happened and they decide to stay there. During the night, weird things happen."},
{"Title": "Zombie (2019) - full transcript", "Plot": "Trapped in a resort which suffers a zombie outbreak, a group of individuals have to figure out how to escape the resort alive."},
{"Title": "Zombie (1979) - full transcript", "Plot": "A zombie is found aboard a boat off the New York coast which belongs to a famous scientist. Peter West, a journalist, travels to the Antilles with Ann, the daughter of the scientist. On the way, they meet with Brian, an ethnologist, and Susan. When they arrive at Matul Island, they find Dr. Menard, and discover a terrifying disease which is turning the islanders into horrifying zombies which devour human flesh and seem indestructible.."},
{"Title": "Zombi Child (2019) - full transcript", "Plot": "A man is brought back from the dead to work in the hell of sugar cane plantations. 55 years later, a Haitian teenager tells her friends her family secret - not suspecting that it will push one of them to commit the irreparable."},
{"Title": "Zombeavers (2014) - full transcript", "Plot": "ZOMBEAVERS is an action-packed horror/comedy in which a group of college kids staying at a riverside cabin are menaced by a swarm of deadly zombie beavers. A weekend of sex and debauchery soon turns gruesome as the beavers close in on the kids. Riding the line between scary, sexy and funny, the kids are soon fighting for their lives in a desperate attempt to fend off the hoard of beavers that attack them in and around their cabin."},
{"Title": "Zombae (2022) - full transcript", "Plot": "When a suburban housewife discovers that her husband has become a Zombie with an appetite for human flesh, she must decide whether to stay in the marriage or wade into the dating pool."},
{"Title": "Zombadings 1: Patayin sa shokot si Remington (2011) - full transcript", "Plot": "Remington is in love with Hannah but she finds him lazy and uncouth. Then he starts to change. Suddenly he is becoming neater, nicer, more sensitive. Is he doing it for her? Or is something beyond his control changing him into someone he is not? He discovers that his gradual transformation is tied to something he did long ago, to childhood transgressions and curses uttered in graveyards. Hannah falls for the new and improved Remington, but he starts falling for someone else. As the ghosts of Remington's past come to haunt him, so do the the Zombadings. Undead, fabulous, they threaten to rock this sleepy town to death."},
{"Title": "Zombacter: Center City Contagion (2020) - full transcript", "Plot": "Professor Jake Northrop (Eric Starkey) is horrified to learn that his experimental, bio-computer bacteria turns people into flesh-eating monsters. While most of his accidental creations are..."},
{"Title": "Zólty szalik (2000) - full transcript", "Plot": null},
{"Title": "Zolotye roga (1973) - full transcript", "Plot": "A long time ago a splendid deer with golden antlers lived in the woods, always protecting the poor and weak and disdaining evil. In a little village nearby the woods widow Yevdokya lived with her twin daughters Mashenka and Dashenka, her son and her old father. One day the girls observe robbers hunting the deer. Shortly after they are lured into the woods by forest spirits. Infuriated about their presence, witch Baba Yaga turns them into fawns. Meanwhile, Yevdokya searches for her daughters. For protecting the deer of robbers she gets a magical ring to protect her from danger. The deer advises her to set off to the red sun or the clear moon. But both cannot reach the magic woods with their light. Finally, the boy accompanied by his cat goes in search for sisters and mother."},
{"Title": "Zolotye kolosya (1958) - full transcript", "Plot": null},
{"Title": "Zlatna pracka (1967) - full transcript", "Plot": "Film comedy about 19th century Serbian peasants who emigrate to the Wild West."},
{"Title": "Zlati uhori (1979) - full transcript", "Plot": "A little boy, named Prdelka, traveled with his father from Prague to the country during the Second World War. There, the boy became friends with a local fisherman and learned to catch the golden eels. Eventually, his father and mother were arrested by the Nazis and the boy stayed with the fisherman."},
{"Title": "ZK: Elephant's Graveyard (2015) - full transcript", "Plot": "The rural town of Elwood is a \"bubble\" against the backdrop of a suspected global infection that appears connected to natural gas fracking. A small band of young adults under the training of ex-military soldier Seiler (Billy Zane)keeps the town safe while patrolling the fence line that locks the residents inside. There is something wrong with the town, with more dread and fear penned up inside than what awaits on the frontier. Young Ian Sommers realizes he needs to get free, no matter what lies beyond Elwood's fence and tries to convince others to do the same."},
{"Title": "Zizotek (2018) - full transcript", "Plot": "A 9-year-old boy left by his mother in the middle of a forest meets a hermit who has taken a vow silence and form a unique father-son relationship."},
{"Title": "Zizek! (2005) - full transcript", "Plot": "A look at the controversial author, philosopher and candidate for Slovenian presidency: Slavoj Zizek."},
{"Title": "Zivot a neobycejna dobrodruzstvi vojaka Ivana Conkina (1994) - full transcript", "Plot": "Set in a small Ukrainian village during the outbreak of war with Germany in 1941 Private Chonkin, not overly endowed with intelligence, is left to guard a downed military aircraft. The authorities appear to have forgotten about him so this leaves him free to work his chams on the village postmistress, Njura, untill the local militia are tipped off."},
{"Title": "Zits (1988) - full transcript", "Plot": "A group of middle school students start selling fake military plans to the KGB to pay for their music teacher's eye operation."},
{"Title": "Zis Boom Bah (1941) - full transcript", "Plot": "\"Hey, kids, let's get together and put on a show!\" That's the idea behind this raucous spoof about a vaudeville performer who goes to college to spy on her bratty son."},
{"Title": "Zire saghfe doodi (2017) - full transcript", "Plot": "Shirin who has problems with her husband and child is searching for a way to communicate with them and solve her family problems but she can not succeeded in that so reaches a crisis. Her second try to get out of this crisis makes her to confront new challenges."},
{"Title": "ZIPPER: Coney Island's Last Wild Ride (2012) - full transcript", "Plot": "A story about greed, politics and the land grab of the century, ZIPPER chronicles the battle over an American cultural icon. Small-time ride operator, Eddie Miranda, proudly operates a carnival contraption called the Zipper in the heart of Coney Island's gritty amusement district. When his rented lot is snatched up by a real estate mogul, Eddie and his ride become casualties of a power struggle between the developer and the City of New York over the future of the world-famous destination. Be it an affront to history or simply the path of progress, the spirit of Coney Island is at stake. In an increasingly corporate landscape, where authenticity is often sacrificed for economic growth, the Zipper may be just the beginning of what is lost."},
{"Title": "Zipper (2015) - full transcript", "Plot": "Sam Ellis is a man on the rise - a federal prosecutor on the cusp of a bright political future. But what was meant to be a one-time experience with a high-end escort instead turns into a growing addiction. His moral compass unraveling, his new demon threatens to destroy his life, family and career."},
{"Title": "Zindy the Swamp Boy (1973) - full transcript", "Plot": "A fugitive lives apart from society, in a swampy area, right in the jungle, with the company of his grandson."},
{"Title": "Zindagi Na Milegi Dobara (2011) - full transcript", "Plot": "Three friends decide to turn their fantasy vacation into reality after one of their friends gets engaged."},
{"Title": "Zimtstern und Halbmond (2010) - full transcript", "Plot": "German ship captain Gottfried Hinrichs reluctantly retires to his Bavarian home, hoping to find comfort when his daughter Barbara moves back home, convenient now she has become a commercial pilot. So he dishes out the usual objections when she tells to have found her mate, while ma Lisbeth tries to shush. When the lovers turn up for Christmas Eve, a culture shock follows, for her dream prince is Palestinian unemployed would be-pilot Kamal Abu Khalil, and neither 'liberal' parent extends effective tolerance to Islamic in-potential laws. Ultimately Gottfried is worn down, but then the incompatible religious marriage norms seem to break up the couple itself. It gets even worse when his parents found out and fly in, while she feels neglected as Kemal starts an electronic muezzin Internet firm with a friend."},
{"Title": "Zhanym, ty ne poverish (2020) - full transcript", "Plot": "It all starts corny - a quarrel of a young married couple. The spouses are waiting for their first child, the situation is heating up every day, and the main character Dastan, is unable to withstand the constant onslaught of his wife, decides to run away for at least one day with his friends - a would-be businessman and a district police officer. The men decide to go fishing and everything would have gone smoothly, if not for a series of unforeseen, sudden, and incomprehensible events ."},
{"Title": "Zhang Sanfeng 2: Tai Chi Master (2020) - full transcript", "Plot": null},
{"Title": "Zhagaram (2019) - full transcript", "Plot": "A youngster sets out in search of a treasure based on the clues left behind by his grandfather."},
{"Title": "Zew morza (1927) - full transcript", "Plot": null},
{"Title": "Zeta: When the Dead Awaken (2019) - full transcript", "Plot": "Deon witness a strange incident when a friend he beats suddenly bites the nurse's neck and becomes a cannibal. After that, the attacks from the zombies happen quickly at school and on the streets, so Deon picks up his mother, Isma, in Teratai Asri apartment. Deon and his mother are trapped inside the apartment while other residents has fled. Meanwhile at the Five Military Base, Colonel Vito welcomes Richard, Deon's father, a scientist, who discovered the origin of the outbreak: originating from the evolution of an amoeba parasite named Naegleria-ross zeta, and that the Zeta serum he had created located in Teratai Asri apartment. Colonel Vito decides that their team visit a zombie killer gang called Blue River to get the best combat strategy against the zombies. Deon also tries to fight the zombies who attack the apartment."},
{"Title": "Zerwany (2003) - full transcript", "Plot": "From orphanage to foster home and back, then to the reformatory, 10-year-old Mateusz endures cruel brutality while aspiring to unite with his mother."},
{"Title": "Zerre (2012) - full transcript", "Plot": "In a city full of unemployment, people, their troubles and lives, are they as mundane, haphazard and tiny as myriadly dispersed particles? What about Zeynep, clinged onto life with her little daughter and mother, how much space does she cover up in this immense Universe?"},
{"Title": "Zeroville (2019) - full transcript", "Plot": "A young actor arrives in Hollywood in 1969 during a transitional time in the Industry."},
{"Title": "Zeros and Ones (2021) - full transcript", "Plot": "An American soldier stationed in Rome with the Vatican blown up, embarks on a hero's journey to uncover and defend against an unknown enemy threatening the entire world."},
{"Title": "Zerosen moyu (1984) - full transcript", "Plot": "Two young men are recruited into the Japanese air force just before outbreak of WW2 by the testpilot of Japans new super fighter - the Zero. The movie is told in reverse from the point of one of the young men who dossn't qualify for the pilot traning and instead joins the ground crew. It chronicles the entire history of the famous fighter from the first prototype test flights all through the war."},
{"Title": "Zerophilia (2005) - full transcript", "Plot": "Luke, a young man insecure about his masculinity, must solve the mystery of his rare genetic condition, Zerophilia, that changes him from male to female anytime he's aroused--which noticeably complicates his love life. Journey with Luke into the wild world of Zerophilia to discover that you can't change your true nature, even if it can change you. A coming-of-age cult classic."},
{"Title": "Zeroes (2019) - full transcript", "Plot": "When best friends, Ray and Kenneth, drunkenly foil a robbery, Philadelphia becomes abuzz with the antics of these local heroes."},
{"Title": "Zero Weeks (2017) - full transcript", "Plot": "What do the United States and Papua New Guinea have in common? They're the only countries in the world without paid family leave. Most Americans agree that family comes first but in the richest country in the world, having a baby, a medical emergency or an aging parent can be a trigger into poverty. No matter where you work or what zip code you live in, you should be able to welcome a new child, care for an aging parent or tend to a cancer diagnosis without facing financial disaster. But because 78% of Americans say they live paycheck-to-paycheck, families are often forced to choose between taking time off to care for a loved one or to continue work to keep their job and health care. Nearly 1 in 4 mothers return to work within ten days of having a baby and 2/3 of the current workforce are providing care for an aging parent. Weaving powerful stories together with insightful interviews with leading policymakers, economists, researchers, and activists, ZERO WEEKS explores America's paid leave crisis and the cost of doing nothing. ZERO WEEKS is the fourth documentary by award-winning director, Ky Dickens. A female director, with a track record for creating poignant work known for shifting policy and public opinion, Dickens was inspired to make Zero Weeks, after facing financial depletion and emotional turmoil for \"not enough time,\" due to a lack of paid leave, after the birth of her first child."},
{"Title": "Zero Tolerance (1999) - full transcript", "Plot": "Johan is a two-fisted Gothenburg cop who finds himself in a shoot-out with jewel robbers. After the smoke has cleared, one robber, shot by his accomplice, and an innocent bystander, are dead. Three witnesses, including Helen, identify thug extraordinaire Leo Gaut as being the dead crook's trigger-happy colleague. Gaut soon threatens the three witnesses, and only Johan, the badge-wearing hero, can save them."},
{"Title": "Zenobia (1939) - full transcript", "Plot": "A southern country doctor is called on by a visiting circus man to cure his sick elephant. After the doctor heals the grateful beast, the elephant becomes so attached to him that it starts to follow him everywhere."},
{"Title": "Zenith (2010) - full transcript", "Plot": "In a hellish future where human beings have become stupefied by the state of permanent happiness they have been genetically altered to experience, Jack (Peter Scanavino) offers relief via drugs that cause his customers the welcome phenomenon of pain. But when Jack receives a mysterious videotape of his dead father, he sets out to unmask the dangerous conspiracy that has created this dystopian world."},
{"Title": "Zengo (2020) - full transcript", "Plot": null},
{"Title": "Zenek (2020) - full transcript", "Plot": "Zenon Martyniuk, a boy from the Podlasie village, who realizes his great dream is to sing and entertain the crowds. It shows Zenek's path to enormous success, which he achieved thanks to persistence and hard work."},
{"Title": "Zenabel (1969) - full transcript", "Plot": "Zenabel, a young woman from a humble background, discovers that she is actually the daughter of a Spanish nobleman who was killed by a ruthless don, Alonso, who took the title. So Zenable assembles a group of misfit friends to reclaim her title."},
{"Title": "Zen (2009) - full transcript", "Plot": "'Zen' Buddhist teacher Dogen Zenji is a very important religious person during the Kamakura period, 750 years ago. After his mother died, he decides to move to China and settle as a Buddhist teacher. One bright morning, enlightened, Zenji returns to Japan as a devoted evangelist of the 'new' Buddhism. However, this new form of Buddhism is not accepted in all communities."},
{"Title": "Zelly and Me (1988) - full transcript", "Plot": "A young orphan who lives with her grandmother in a large Virginian home infatuates herself with the voices of Joan d'Arc. Her nanny seeks out the help of a rich suitor (David Lynch's first real acting role) to take her and the orphan away when she realizes that the often cruel grandmother cannot offer the orphan the love that she needs. Ends with an unpredictable plot twist."},
{"Title": "Zelig (1983) - full transcript", "Plot": "Fictional documentary about the life of human chameleon Leonard Zelig, a man who becomes a celebrity in the 1920s due to his ability to look and act like whoever is around him. Clever editing places Zelig in real newsreel footage of Woodrow Wilson, Babe Ruth, and others."},
{"Title": "Zelary (2003) - full transcript", "Plot": "A nurse and her surgeon-lover are part of a resistance movement in 1940s Czechoslovakia. When they are discovered, her lover flees and she must find a place to hide. A patient whose life she saved, a man from a remote mountain village where time stopped 150 years ago, agrees to hide her as his wife."},
{"Title": "Zejtra naporád (2014) - full transcript", "Plot": "This romantic comedy, shot in a road-movie style, tells the story of businessman Petr Kraus (Pavel Batek) and his personal transformation. After returning from China, where he supervised the production of clothing for his customers, Petr finds out that the manufacturer had ruined the whole order and so he gets into trouble with the contractor (Jirí Lábus) who wants some astronomical compensation for the damage. Peter knows that he should solve the problem quickly, but instead he decides to go on a trip seeking his personal happiness and an escape from responsibility. Fortunately, his close friends, Tereza (Vica Kerekes) and Pavel (Filip Blazek) are there to help..."},
{"Title": "Zeitgeist: Addendum (2008) - full transcript", "Plot": "Zeitgeist Addendum, attempts to locate the root causes of this pervasive social corruption, while offering a solution. This solution is not based on politics, morality, laws, or any other \"establishment\" notions of human affairs, but rather on a modern, non-superstitious based understanding of what we are and how we align with nature, to which we are a part. The work advocates a new social system which is updated to present day knowledge, highly influenced by the life long work of Jacque Fresco and The Venus Project."},
{"Title": "Zeitgeist (2007) - full transcript", "Plot": "This film gathers information from many sources and puts it together in a way that shows it is possible for people to be manipulated by large institutions, governments and economic powers. It is divided into 3 parts. 1. Religion: Pagan astrological beliefs compared to modern and ancient religions. (9:35-35:53) 2. 9/11: An overview of the numerous questionable aspects of this immensely important event. (35:54-1:09:16) 3. The Federal Reserve Bank: A history of its formation and ability to control the economy. (1:09:17-1:56:23) With many news clips from tragic events in history, audio excerpts from those who believe people are being misled about the level of freedom they have."},
{"Title": "Zeiram (1991) - full transcript", "Plot": "Teppei and Kamiya, two average joes working in the electronic services industry, stumble upon the intergalactic bounty-hunter Ilia, and her partner, the artificial intelligence named Bob. Both men are accidentally transported to the Zone, a virtual reality in which Bob has trapped Ilia's latest prey, a biological weapon named Zeram. The Earth natives must both survive the experience and help Ilia capture Zeram before the Zone disappears around them."},
{"Title": "Zedj (1971) - full transcript", "Plot": null},
{"Title": "Zatôichi (1989) - full transcript", "Plot": "Nearing the village of his sensei, Zatoichi decides to pay the teacher a visit, only to learn that he has been murdered and his daughter forced into prostitution. Ichi's investigation into these injustices uncovers a corrupt alliance between government officials and criminals, putting the blind swordsman on a bloody path of retribution in one of the series' darkest entries."},
{"Title": "Zathura: A Space Adventure (2005) - full transcript", "Plot": "Danny and Walter are two brothers who barely get along even while driving their parents to distraction as their older sister tries to ignore them. Despite their squabbling, the brothers manage cooperate enough to play an old mechanical board game named Zathura. However, after their first move, they find that the game has apparently flung them, their sister and their entire house into outer space. Furthermore, the brothers surmise the only way to return home is to finish the game. However with almost every move, new dangers arise as the siblings find themselves learning to cooperate in ways they never expected as they realize what they mean to each other."},
{"Title": "Zarna Garg: One in a Billion (2023) - full transcript", "Plot": "Features fiercely protective Indian immigrant mother Zarna Garg in action."},
{"Title": "Zarkorr! The Invader (1996) - full transcript", "Plot": "An \"average\" postal worker is informed by a tiny alien hologram which looks like a teenage girl that he is the \"choosen one\" to destroy a giant reptile to save the Earth."},
{"Title": "Zardoz (1974) - full transcript", "Plot": "2293. Zardoz, an unseen \"God\" who speaks through an idol - a large stone statue of a head - leads a barbaric race called the Brutals, who live a harsh existence in the Outlands. Zardoz tells the Brutals that once they die, they will be transported to the Vortex, where they will live happily as immortals. He has armed a small group - the Exterminators - with guns, as Zardoz's philosophy is that killing is good, and procreation is the root of all that is bad. In reality, Zardoz is Arthur Frayn, from a competing more advanced race called the Eternals who live in paradise in the Vortex. The Eternals truly are immortal as they do not age and their bodies undergo reconstruction if they \"die\". As such, they truly do not believe in procreation as their society has reached perfect equilibrium. Past human acts such as sex and sleep are obsolete in their advanced state. All major decisions are achieved through pure democracy. The Eternals, however, are not immune to non life threatening disease or sin, the latter which is punishable by aging, only making their life less pleasant but not ever killing them. Arthur's mission as Zardoz is to control, monitor and study the Brutals for the Eternals. Being in the Outlands, Arthur is isolated without communication back to the Vortex and the Eternals. In his work as an Exterminator, Zed, by accident, is able to find his way to the Vortex as a still alive being. The Eternals vote to keep Zed alive temporarily so that they can study him before they kill him. Among the Eternals who have direct interactions with Zed are: May, the lead scientist, who believes Zed is a blessing in that they have not had access to a Brutal in some time; Friend, a hedonist who wants to use Zed as the animal he considers him to be; and Consuela, the hard lined one who believes in vigilante justice. In the Eternals' access to Zed, they may learn if he making it to the Vortex was indeed an accident. In addition, their so-called Utopian society may be exposed for what it truly is."},
{"Title": "Zarak (1956) - full transcript", "Plot": "On the mountainous frontier between British India and Afghanistan, circa 1860s, Zarak Khan kisses Salma, the youngest wife of his father, Haji Khan. Outraged, his father orders Zarak to be flogged to death but spares his life at the urging of an elderly Mullah. Zarak now leaves his village and becomes a notorious outlaw, prompting the British to assign a Major Ingram to capture him. Zarak and Ingram have several encounters, developing a grudging respect for each other. When Ingram is captured by Ahmad, one of Zarak's rivals, Zarak risks his life to save the British officer."},
{"Title": "Zarafa (2012) - full transcript", "Plot": "The plot of the film has a grandfather telling his grand kids the story of Maki, a young boy who escapes from slave traders, befriends a giraffe (the title character), cross the desert, meet a pirate, and a few other things on a trip that takes him from Africa to Paris."},
{"Title": "Zapped! (1982) - full transcript", "Plot": "Barney Springboro and Peyton Nichols are fun-loving high school students working on a science project with white mice. When one of the mice begins to move food toward itself with out touching it, Barney finds he has accidentally discovered a formula for telekinetic powers. Now, how much trouble can a high school kid who can move things with just his mind get into?"},
{"Title": "Zapped (2014) - full transcript", "Plot": "Sixteen-year-old Zoey Stevens, a skilled dancer and straight-A student, is having a hard time adjusting to a new high school, a new and klutzy dance squad, a new step-dad, three new rowdy step-brothers and an unruly dog, but things change when a dog training app on her smart phone begins to somehow control all the boys around her."},
{"Title": "Zappa (2020) - full transcript", "Plot": "An in-depth look into the life and work of musician Frank Zappa."},
{"Title": "Zapatlela (1993) - full transcript", "Plot": "Inspector Mahesh Jadhav kills a wanted gangster only to be unaware that his spirit has possessed a doll lying in a box nearby. The doll happens to be a gift from Gauri to his brother Lakshhya to be sent to India from America. But no one has the idea that the doll gets possessed in the process. Now, the spirit of the dead gangster wants to come alive yet again in a human body. But the only human body which he could be re-born into happens to be that of Lakshya's. Hence, the doll is on the way to hunt down Lakshya. Will it succeed ?"},
{"Title": "Zanox (2022) - full transcript", "Plot": "As a result of a drug experiment, Misi will be able to travel through time, but only if he drinks from a special homemade spirit."}
]