[
{"Title": "Z (1969) - full transcript", "Plot": "In a mid-sized metropolis (population 500,000) in a right-wing military led country, a pacifist organization, which supports the opposition party in the government, is planning on holding an anti-military, nuclear disarmament rally. The organization's charismatic leader - the deputy - is scheduled to arrive in the town from the capital the day of the rally. Beyond the problems arranging the rally due to the probable incitement of violence at such a rally, the organization learns of an unconfirmed report that there will be an attempt on the deputy's life. The rally does happen, after which a three-wheeled kamikaze runs over the deputy, who eventually passes away from his injuries. The official report is that the incident was a drunken accident. In reality, the deputy's death was murder orchestrated by the secret police, the general for who likens the pacifist organization to mildew killing off agricultural crops. A magistrate is assigned to the case. Although he does have political views, he is more interested in finding out the truth, and as such has to wade through the political rhetoric and politically motivated testimony he hears. Thrown into the mix is a photojournalist who too is looking for the truth, as it, he believes, will make a great front page story."},
{"Title": "Z-O-M-B-I-E-S (2018) - full transcript", "Plot": "Students from Zombietown are transferred to a high school in a suburban town preoccupied with uniformity, traditions and pep rallies."},
{"Title": "Z miasta Lodzi (1968) - full transcript", "Plot": "This documentary explores the changing faces of the old Polish city of Lodz, and how its modernization, both physically and culturally, affects the older, more conservative residents, many ..."},
{"Title": "Z (2019) - full transcript", "Plot": "A family find themselves terrorized by their eight-year-old son's imaginary friend."},
{"Title": "Za ji wang ming dui (1979) - full transcript", "Plot": "The heroes pose as gun dealers and acrobats in order to get close to the bad guys so they can avenge the death of one of their brothers. In the end they lock the bad guys in a warehouse for a final battle to the death."},
{"Title": "Zabak (1962) - full transcript", "Plot": "The son of Isban-based Hasanshah, multi-linguist healer, Zabak, who was born after his parents' Haj trip, falls in love with wealthy Zainab, the daughter of Hakim-e-Alla, much to the chagrin of Mirza Qasim Beg. He complains to her father, who has both father and son arrested and humiliated. Unable to handle the sentence of shaving his head and beard, Hasanshah kills himself, and Zabak is exiled. His mother, unable to bear the separation, blinds herself. Zabak reluctantly joins a group of bandits led by Usmanshah Saudagar after preventing the sexual molestation of his daughter, Sameena. When the group comes to know that Qasim is to wed Zainab, they attack and loot the community, and Zainab is abducted by a crippled bandit. With the help of Khacharshah and Salma, Zabak helps Zainab flee from captivity and both renew their romance. But not for long - for soon Zabak will be on the run from an enraged Usmanshah, while Zainab will be abducted by Shahzada Parvez - the only son of Sultan-e-Yaman - who wants to make her his Mallika by any and all means."},
{"Title": "Z.P.G. (1972) - full transcript", "Plot": "In the not too distant future, a very smoggy and overpopulated Earth government makes it illegal to have children for a generation. One couple, unsatisfied with their substitute robot baby, breaks the rules and gets in a lot of trouble. (Z.P.G. stands for Zero Population Growth.)"},
{"Title": "Za duzy na bajki (2022) - full transcript", "Plot": "In Waldek's life, filled mainly with computer games, there is a real earthquake. During her absence, mum stays under the care of a crazy and unpredictable aunt, who introduces discipline that has been alien to him so far and imposes new duties. But although an extraordinary relative gives Waldek a real survival camp, the boy also receives the most valuable life lesson from her."},
{"Title": "Za Marksa... (2012) - full transcript", "Plot": "The film is about a clash between soviet-bred workers and wild realities of Russian capitalism. The plot is based on a real story of today's crisis when production owners sort out their problems by means of cutting workers' wages which are already low."},
{"Title": "Z-O-M-B-I-E-S 2 (2020) - full transcript", "Plot": "The continuing adventures of Seabrook High students Addison and Zed, whose budding romance is threatened by the arrival of werewolves."},
{"Title": "Zack Snyder's Justice League (2021) - full transcript", "Plot": "Determined to ensure Superman's ultimate sacrifice was not in vain, Bruce Wayne aligns forces with Diana Prince with plans to recruit a team of metahumans to protect the world from an approaching threat of catastrophic proportions. The task proves more difficult than Bruce imagined, as each of the recruits must face the demons of their own pasts to transcend that which has held them back, allowing them to come together, finally forming an unprecedented league of heroes. Now united, Batman, Wonder Woman, Aquaman, Cyborg and The Flash may be too late to save the planet from Steppenwolf, DeSaad and Darkseid and their dreadful intentions."},
{"Title": "Zai na he pan qing cao qing (1982) - full transcript", "Plot": "Da-Nian is a young man from Taipei. He goes to a remote village and works as a substitute teacher. He and Su-Yun, another teacher at the school, fall in love. There are several students in his class who are like the naughty \"three musketeers\", and a sad, silent boy Xiang-Wang, who's parents are divorced. Besides, in order to support the family, Xian-Wang's father kills the fish in the river with electricity, which is against the law and causes a lot of damage to the natural resources. Because of this, Xian-Wang has been teased by other school children. At last, he becomes so upset and runs away from home..."},
{"Title": "Zabriskie Point (1970) - full transcript", "Plot": "An epic portrait of late Sixties America, as seen through the portrayal of two of its children: anthropology student Daria (who's helping a property developer build a village in the Los Angeles desert) and dropout Mark (who's wanted by the authorities for allegedly killing a policeman during a student riot)..."},
{"Title": "Zack (1983) - full transcript", "Plot": "Zack is the story of a private investigator who, like many Christians, never considered the importance of a commitment to his own church. But Zack takes on an insurance investigation and in the process discovers a lot more than just the solution to the case."},
{"Title": "Zack and Miri Make a Porno (2008) - full transcript", "Plot": "Zack and Miri are two lifelong platonic friends who make an adult film to pay the rent of their apartment. With their friend Delaney, the couple set out for auditionees for their porn film, but in the process of filming, they realize they feel more for each other than they had before."},
{"Title": "Zandy's Bride (1974) - full transcript", "Plot": "Zandy Allan purchases a mail-order bride, Hannah Lund. He treats her as a possession, without respect or humanity, until their shared ordeal as they struggle to survive develops in him a growing love."},
{"Title": "Zai jian ba shao nian (2020) - full transcript", "Plot": null},
{"Title": "Zambo, King of the Jungle (1972) - full transcript", "Plot": "ZAMBO is king of the jungle! Deep in the jungles of central Africa, a lone figure moves swiftly through the trees. Often heard, sometimes seen, but never forgotten, the legend of ZAMBO is about to become real! In another life he was framed for a murder he didn't commit and left to rot in a filthy African prison, only to deftly escape into the wilderness. Friend to both man and animal, Zambo selflessly protects the African people from the oppressive forces of the outside world. As the legend of Zambo becomes too big to ignore, an expedition led by explorers Professor Woodworth, Perkins, and Juanez presents Zambo with his greatest fear: discovery. With only his strength, wits, and the help of the jungle itself, Zambo is in for the fight of his life!"},
{"Title": "Zaman (1983) - full transcript", "Plot": "An undercover inspector of the Antwerp criminal investigation unit faces problems not only in his professional life, but also at home. When he is partnered with a young, over-confident colleague, he loses control over the case in hand, a situation that further takes its toll on his marriage. He's forced to ask himself whether his job is an addiction, a hunt for people that becomes more exciting the shrewder his opponent is."},
{"Title": "Zameen Aasmaan (1972) - full transcript", "Plot": "Disciplinarian Shanti Swaroop (Ashok Kumar) alienates himself from his wife Urmilla (Indrani Mukherjee); son, Ravi (Sunil Dutt), and daughter, Roopa (Yogeeta Bali). His wife passes away, and he marries another woman, Maya (also Indrani Mukherjee), who looks like his wife. Maya has an on-going affair with Heeralal \"Heera\" (Ramesh Deo) unknown to Shanti Swaroop. A fall from a staircase makes Shanti Swaroop lose his eyesight, and makes him totally dependent on his wife, and a nurse, Kalpana (Rekha). Blinded and unable to see reason clearly, he refuses to let his daughter marry Ram (Sharad) as he is poor; and asks Ravi to leave his house, when Ravi speaks out against Heera and Maya, thus leaving the ground wide open for them to attempt to initially permanently blind him, and then blame the nurse for this negligence."},
{"Title": "Zambezia (2012) - full transcript", "Plot": "Set in a bustling bird city on the edge of the majestic Victoria Falls, \"Zambezia\" is the story of Kai - a naïve, but high-spirited young falcon who travels to the bird city of \"Zambezia\" where he discovers the truth about his origins and, in defending the city, learns how to be part of a community."},
{"Title": "Zamane Se Kya Darna (1994) - full transcript", "Plot": "Virendra Singh lives wealthy lifestyle in Bommbay, India, along with his wife, Shalini, and son, Vikram. He gambles on Diwali, loses all his money, borrows a large amount from his friend, Gajendra Singh, ends up losing this too, and returns home along with Gajendra and his brother to try and repay as much as he can. When Gajendra's brother attempts to molest Shalini, Virendra's kills him and flees. He boards a bus which meets with an accident, leaving only two survivors - himself and a young heiress named Anju. He adopts her, looks after her estate and assumes a new name, Sardar Rajpal, and becomes wealthy over time. Years later Anju has grown up and finds out about her foster father's tragic story and decides to try and re-unite this family. She posts two advertisements in Bombay's newspapers, to hire an Estate Manager, as well as asking for the whereabouts of Shalini and Vikram. Little does she know that she has opened up a Pandora's box for the advertisements were read by none other than Gajendra and his son, Shakti, who are well aware that Virendra's wife and son had both perished in a fire that engulfed their residence on that very night - and now they are poised to re-enter Virendra's life - with Shakti re-naming himself Vikram with a view of marrying Anju, inheriting her wealth and then the duo plan to kill Virendra to avenge the death of their brother and uncle respectively."},
{"Title": "Zaklete rewiry (1975) - full transcript", "Plot": "A teenage country boy starts working in a restaurant of the famous Pacific Hotel in the 1930s. He soon discovers that to get promoted one needs to conform and sacrifice his dignity."},
{"Title": "Zaky Chan (2005) - full transcript", "Plot": "Zaky, a lazy young man decides to work for his father's boss as a bodyguard to protect his stubborn daughter Shereen and her little brother. Soon he becomes a part of the family and a foe for Shereen's jealous boyfriend Hazem."},
{"Title": "Zánik domu Usherú (1982) - full transcript", "Plot": "In this animated version of Edgar Allan Poe's story, a traveller arrives at the Usher mansion to find that the sibling inhabitants are living under a mysterious family curse: The brother's senses have become painfully acute, while his sister has become nearly catatonic. As the visitor's stay at the mansion continues, the effects of the curse reach their terrifying climax, and he must choose between his concern for his hosts' safety, and his own."},
{"Title": "Zazda strasti (1991) - full transcript", "Plot": null},
{"Title": "Zapatlela (1993) - full transcript", "Plot": "Inspector Mahesh Jadhav kills a wanted gangster only to be unaware that his spirit has possessed a doll lying in a box nearby. The doll happens to be a gift from Gauri to his brother Lakshhya to be sent to India from America. But no one has the idea that the doll gets possessed in the process. Now, the spirit of the dead gangster wants to come alive yet again in a human body. But the only human body which he could be re-born into happens to be that of Lakshya's. Hence, the doll is on the way to hunt down Lakshya. Will it succeed ?"},
{"Title": "Zaza (1923) - full transcript", "Plot": null},
{"Title": "Zátopek (2021) - full transcript", "Plot": "Autumn 1968, the Australian running record holder Ron Clarke is coming to Prague, hoping that his old friend and role model, Emil Zátopek, the most famous Czech athlete of all time, will help him overcome the biggest crisis of his career."},
{"Title": "Zebra in the Kitchen (1965) - full transcript", "Plot": "A young boy lets the animals out of their cages at the Zoo, to set them free, but the animals start taking over the town."},
{"Title": "Zatoichi and the One-Armed Swordsman (1971) - full transcript", "Plot": "While traveling the Japanese countryside the blind masseur Zatoichi comes across the One Armed Swordsman, Wang Kang, who is in hiding and protecting a child from a corrupt Japanese priest and a group of yakuza. Zatoichi and Wang Kang, each from very different worlds yet heroic swordsman in their own right, at first seem to get along but a language barrier and a series of misunderstanding leads Kang to distrust Ichi. Soon the two heroes are at each other throats while each attempts to stop the true villains from taking the child."},
{"Title": "Zathura: A Space Adventure (2005) - full transcript", "Plot": "Danny and Walter are two brothers who barely get along even while driving their parents to distraction as their older sister tries to ignore them. Despite their squabbling, the brothers manage cooperate enough to play an old mechanical board game named Zathura. However, after their first move, they find that the game has apparently flung them, their sister and their entire house into outer space. Furthermore, the brothers surmise the only way to return home is to finish the game. However with almost every move, new dangers arise as the siblings find themselves learning to cooperate in ways they never expected as they realize what they mean to each other."},
{"Title": "Zardoz (1974) - full transcript", "Plot": "2293. Zardoz, an unseen \"God\" who speaks through an idol - a large stone statue of a head - leads a barbaric race called the Brutals, who live a harsh existence in the Outlands. Zardoz tells the Brutals that once they die, they will be transported to the Vortex, where they will live happily as immortals. He has armed a small group - the Exterminators - with guns, as Zardoz's philosophy is that killing is good, and procreation is the root of all that is bad. In reality, Zardoz is Arthur Frayn, from a competing more advanced race called the Eternals who live in paradise in the Vortex. The Eternals truly are immortal as they do not age and their bodies undergo reconstruction if they \"die\". As such, they truly do not believe in procreation as their society has reached perfect equilibrium. Past human acts such as sex and sleep are obsolete in their advanced state. All major decisions are achieved through pure democracy. The Eternals, however, are not immune to non life threatening disease or sin, the latter which is punishable by aging, only making their life less pleasant but not ever killing them. Arthur's mission as Zardoz is to control, monitor and study the Brutals for the Eternals. Being in the Outlands, Arthur is isolated without communication back to the Vortex and the Eternals. In his work as an Exterminator, Zed, by accident, is able to find his way to the Vortex as a still alive being. The Eternals vote to keep Zed alive temporarily so that they can study him before they kill him. Among the Eternals who have direct interactions with Zed are: May, the lead scientist, who believes Zed is a blessing in that they have not had access to a Brutal in some time; Friend, a hedonist who wants to use Zed as the animal he considers him to be; and Consuela, the hard lined one who believes in vigilante justice. In the Eternals' access to Zed, they may learn if he making it to the Vortex was indeed an accident. In addition, their so-called Utopian society may be exposed for what it truly is."},
{"Title": "Zarafa (2012) - full transcript", "Plot": "The plot of the film has a grandfather telling his grand kids the story of Maki, a young boy who escapes from slave traders, befriends a giraffe (the title character), cross the desert, meet a pirate, and a few other things on a trip that takes him from Africa to Paris."},
{"Title": "Zatoichi Goes to the Fire Festival (1970) - full transcript", "Plot": "Cowritten by star Shintaro Katsu, this adventure pits Zatoichi against one of his most diabolical foes: a blind yakuza boss whose reign of terror and exploitation has made him nearly mythic. Guest starring the legendary Tatsuya Nakadai as a ronin haunted by a traumatic past, and featuring an unforgettable nude swordfight in a bathhouse, this twenty-first entry in the series is a fan favorite."},
{"Title": "Závrat (1963) - full transcript", "Plot": "Geologists looking for tin stay at a country hotel.The manager's daughter experiences her first love."},
{"Title": "Zatoichi and the Fugitives (1968) - full transcript", "Plot": "Blind masseur and master swordsman Zatoichi becomes involved with a gang of bandits hiding out in a small village. While they hide in the attic of a silk mill, they manipulate the corrupt chief official of the town. Simultaneously Zatoichi tries to rescue a young woman from the sweatshop conditions of the mill. Eventually he must confront not only the leaders of the town but the outlaw gang in battle."},
{"Title": "Zaytoun (2012) - full transcript", "Plot": "Beirut, 1982: a young Palestinian refugee helps an Israeli fighter pilot escape from PLO captivity because he wants to visit his ancestral family home. En route through war-torn Lebanon their relationship develops into a close bond."},
{"Title": "Zazà (1944) - full transcript", "Plot": null},
{"Title": "Zaza (1938) - full transcript", "Plot": "A sexy singer in a French music hall falls in love with a handsome, but married, aristocrat."},
{"Title": "Zakliata jaskyna (2022) - full transcript", "Plot": null}
]